### Importing Libraries:

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
sns.set()
%matplotlib inline

### Importing Train And Test Dataset:

In [2]:
df_train = pd.read_excel('E:\\Data Science\\Data Sets\\Flight Price Prediction\\Data_Train.xlsx')
df_test = pd.read_excel('E:\\Data Science\\Data Sets\\Flight Price Prediction\\Test_set.xlsx')

In [3]:
df_train.isnull().sum()

Airline            0
Date_of_Journey    0
Source             0
Destination        0
Route              1
Dep_Time           0
Arrival_Time       0
Duration           0
Total_Stops        1
Additional_Info    0
Price              0
dtype: int64

In [4]:
df_train = df_train.dropna()
df_train.isnull().sum()

Airline            0
Date_of_Journey    0
Source             0
Destination        0
Route              0
Dep_Time           0
Arrival_Time       0
Duration           0
Total_Stops        0
Additional_Info    0
Price              0
dtype: int64

In [5]:
df_test.isnull().sum()

Airline            0
Date_of_Journey    0
Source             0
Destination        0
Route              0
Dep_Time           0
Arrival_Time       0
Duration           0
Total_Stops        0
Additional_Info    0
dtype: int64

In [6]:
df_train.shape , df_test.shape

((10682, 11), (2671, 10))

### Combining Train and Test Data For Preprocessing:

In [7]:
df = df_train.append(df_test)
df.head(2)

,Airline,Date_of_Journey,Source,Destination,Route,Dep_Time,Arrival_Time,Duration,Total_Stops,Additional_Info,Price
0,IndiGo,24/03/2019,Banglore,New Delhi,BLR → DEL,22:20,01:10 22 Mar,2h 50m,non-stop,No info,3897.0
1,Air India,1/05/2019,Kolkata,Banglore,CCU → IXR → BBI → BLR,05:50,13:15,7h 25m,2 stops,No info,7662.0

In [8]:
df = df.reset_index()
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13353 entries, 0 to 13352
Data columns (total 12 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   index            13353 non-null  int64
 1   Airline          13353 non-null  object
 2   Date_of_Journey  13353 non-null  object
 3   Source           13353 non-null  object
 4   Destination      13353 non-null  object
 5   Route            13353 non-null  object
 6   Dep_Time         13353 non-null  object
 7   Arrival_Time     13353 non-null  object
 8   Duration         13353 non-null  object
 9   Total_Stops      13353 non-null  object
 10  Additional_Info  13353 non-null  object
 11  Price            10682 non-null  float64
dtypes: float64(1), int64(1), object(10)
memory usage: 1.2+ MB

### Handling Object Features:

#### 1) Handling Date Feature:

In [9]:
df['Date'] = df['Date_of_Journey'].str.split('/').str[0]
df['Month'] = df['Date_of_Journey'].str.split('/').str[1]
df['Year'] = df['Date_of_Journey'].str.split('/').str[2]
df.head(2)

,index,Airline,Date_of_Journey,Source,Destination,Route,Dep_Time,Arrival_Time,Duration,Total_Stops,Additional_Info,Price,Date,Month,Year
0,0,IndiGo,24/03/2019,Banglore,New Delhi,BLR → DEL,22:20,01:10 22 Mar,2h 50m,non-stop,No info,3897.0,24,03,2019
1,1,Air India,1/05/2019,Kolkata,Banglore,CCU → IXR → BBI → BLR,05:50,13:15,7h 25m,2 stops,No info,7662.0,1,05,2019

In [10]:
df['Date'] = df['Date'].astype(int)
df['Month'] = df['Month'].astype(int)
df['Year'] = df['Year'].astype(int)
df.drop(['Date_of_Journey'],axis = 1 , inplace= True)

In [11]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13353 entries, 0 to 13352
Data columns (total 14 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   index            13353 non-null  int64
 1   Airline          13353 non-null  object
 2   Source           13353 non-null  object
 3   Destination      13353 non-null  object
 4   Route            13353 non-null  object
 5   Dep_Time         13353 non-null  object
 6   Arrival_Time     13353 non-null  object
 7   Duration         13353 non-null  object
 8   Total_Stops      13353 non-null  object
 9   Additional_Info  13353 non-null  object
 10  Price            10682 non-null  float64
 11  Date             13353 non-null  int32
 12  Month            13353 non-null  int32
 13  Year             13353 non-null  int32
dtypes: float64(1), int32(3), int64(1), object(9)
memory usage: 1.3+ MB

In [12]:
df_1 = df.copy()

#### 2) Handling Arrival Time And Departure Time Features:

In [13]:
df_1['Arrival_Time'] = df_1['Arrival_Time'].str.split(' ').str[0]

In [14]:
df_1['Arrival_hour'] = df_1['Arrival_Time'].str.split(':').str[0]
df_1['Arrival_min'] = df_1['Arrival_Time'].str.split(':').str[1]
df_1['Arrival_hour'] = df_1['Arrival_hour'].astype(int)
df_1['Arrival_min'] = df_1['Arrival_min'].astype(int)
df_1.drop(['Arrival_Time'],axis=1,inplace=True)

In [15]:
df_1['dept_hour'] = df_1['Dep_Time'].str.split(':').str[0]
df_1['dept_min'] = df_1['Dep_Time'].str.split(':').str[1]
df_1['dept_hour'] = df_1['dept_hour'].astype(int)
df_1['dept_min'] = df_1['dept_min'].astype(int)
df_1.drop(['Dep_Time'],axis=1,inplace=True)

In [16]:
df_1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13353 entries, 0 to 13352
Data columns (total 16 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   index            13353 non-null  int64
 1   Airline          13353 non-null  object
 2   Source           13353 non-null  object
 3   Destination      13353 non-null  object
 4   Route            13353 non-null  object
 5   Duration         13353 non-null  object
 6   Total_Stops      13353 non-null  object
 7   Additional_Info  13353 non-null  object
 8   Price            10682 non-null  float64
 9   Date             13353 non-null  int32
 10  Month            13353 non-null  int32
 11  Year             13353 non-null  int32
 12  Arrival_hour     13353 non-null  int32
 13  Arrival_min      13353 non-null  int32
 14  dept_hour        13353 non-null  int32
 15  dept_min         13353 non-null  int32
dtypes: float64(1), int32(7), int64(1), object(7)
memory usage: 1.3+ MB

In [17]:
df_2 = df_1.copy()

#### 3) Handling Total stops and Route Feature:

In [18]:
df_2['Total_Stops'].unique()

array(['non-stop', '2 stops', '1 stop', '3 stops', '4 stops'],
      dtype=object)

In [19]:
df_2['Total_Stops'] = df_2['Total_Stops'].map({'non-stop':0,'1 stop':1,'2 stops':2,'3 stops':3,'4 stops':4})
df_2['Total_Stops'].unique()

array([0, 2, 1, 3, 4], dtype=int64)

In [20]:
df_2.drop(['Route'],axis=1,inplace=True)

In [21]:
df_3 = df_2.copy()

#### 4) Handling Duration Feature:

In [22]:
df_3['Duration'].head()

0    2h 50m
1    7h 25m
2       19h
3    5h 25m
4    4h 45m
Name: Duration, dtype: object

In [23]:
df_3['Duration'].shape

(13353,)

In [24]:
df_3['duration_hurs'] = df_3['Duration'].str.split(' ').str[0].str.split('h').str[0]
df_3['duration_mins'] = df_3['Duration'].str.split(' ').str[1].str.split('m').str[0]

In [25]:
df_3[df_3['duration_hurs']=='5m']

,index,Airline,Source,Destination,Duration,Total_Stops,Additional_Info,Price,Date,Month,Year,Arrival_hour,Arrival_min,dept_hour,dept_min,duration_hurs,duration_mins
6474,6474,Air India,Mumbai,Hyderabad,5m,2,No info,17327.0,6,3,2019,16,55,16,50,5m,NaN
13342,2660,Air India,Mumbai,Hyderabad,5m,2,No info,NaN,12,3,2019,16,55,16,50,5m,NaN

In [26]:
# Droping rows with wrong Entries
df_4 = df_3.drop([df_3.index[6474], df_3.index[13342]])

In [27]:
df_4[df_4['duration_mins'].isnull()].head(2)

,index,Airline,Source,Destination,Duration,Total_Stops,Additional_Info,Price,Date,Month,Year,Arrival_hour,Arrival_min,dept_hour,dept_min,duration_hurs,duration_mins
2,2,Jet Airways,Delhi,Cochin,19h,2,No info,13882.0,9,6,2019,4,25,9,25,19,NaN
18,18,Air India,Delhi,Cochin,23h,2,No info,13381.0,12,6,2019,19,15,20,15,23,NaN

In [28]:
df_4['duration_mins'] = df_4['duration_mins'].fillna(value = 0)

In [29]:
df_4[df_4['duration_mins'].isnull()].head(2)

Empty DataFrame
Columns: [index, Airline, Source, Destination, Duration, Total_Stops, Additional_Info, Price, Date, Month, Year, Arrival_hour, Arrival_min, dept_hour, dept_min, duration_hurs, duration_mins]
Index: []

In [30]:
df_4['duration_hurs'] = df_4['duration_hurs'].astype(int)
df_4['duration_mins'] = df_4['duration_mins'].astype(int)

In [31]:
df_4['total_duration_in_min'] = df_4['duration_hurs']*60 + df_4['duration_mins']

In [32]:
df_4.head()

,index,Airline,Source,Destination,Duration,Total_Stops,Additional_Info,Price,Date,Month,Year,Arrival_hour,Arrival_min,dept_hour,dept_min,duration_hurs,duration_mins,total_duration_in_min
0,0,IndiGo,Banglore,New Delhi,2h 50m,0,No info,3897.0,24,3,2019,1,10,22,20,2,50,170
1,1,Air India,Kolkata,Banglore,7h 25m,2,No info,7662.0,1,5,2019,13,15,5,50,7,25,445
2,2,Jet Airways,Delhi,Cochin,19h,2,No info,13882.0,9,6,2019,4,25,9,25,19,0,1140
3,3,IndiGo,Kolkata,Banglore,5h 25m,1,No info,6218.0,12,5,2019,23,30,18,5,5,25,325
4,4,IndiGo,Banglore,New Delhi,4h 45m,1,No info,13302.0,1,3,2019,21,35,16,50,4,45,285

In [33]:
df_5 = df_4.drop(['Duration','duration_hurs','duration_mins'],axis=1)
df_5.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 13351 entries, 0 to 13352
Data columns (total 15 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   index                  13351 non-null  int64
 1   Airline                13351 non-null  object
 2   Source                 13351 non-null  object
 3   Destination            13351 non-null  object
 4   Total_Stops            13351 non-null  int64
 5   Additional_Info        13351 non-null  object
 6   Price                  10681 non-null  float64
 7   Date                   13351 non-null  int32
 8   Month                  13351 non-null  int32
 9   Year                   13351 non-null  int32
 10  Arrival_hour           13351 non-null  int32
 11  Arrival_min            13351 non-null  int32
 12  dept_hour              13351 non-null  int32
 13  dept_min               13351 non-null  int32
 14  total_duration_in_min  13351 non-null  int32
dtypes: float64(1), int32(8), int64(2), object(4)
memory usage: 1.2+ MB

#### 5) Handling Airline,Source, Destination and Additional info Features:

In [34]:
Airline_dummy = pd.get_dummies(df_5['Airline'],drop_first=True)
Source_dummy = pd.get_dummies(df_5['Source'],drop_first=True)
Destination_dummy = pd.get_dummies(df_5['Destination'],drop_first=True)
Additional_Info_dummy = pd.get_dummies(df_5['Additional_Info'],drop_first=True)

In [35]:
Airline_dummy = Airline_dummy.astype(int)
Source_dummy = Source_dummy.astype(int)
Destination_dummy = Destination_dummy.astype(int)
Additional_Info_dummy = Additional_Info_dummy.astype(int)

In [36]:
df_6 = pd.concat([df_5,Airline_dummy,Source_dummy, Destination_dummy,Additional_Info_dummy], axis=1)

In [37]:
df_7 = df_6.drop(['index','Airline','Source','Destination','Additional_Info'],axis=1)
df_7.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 13351 entries, 0 to 13352
Data columns (total 39 columns):
 #   Column                             Non-Null Count  Dtype
---  ------                             --------------  -----
 0   Total_Stops                        13351 non-null  int64
 1   Price                              10681 non-null  float64
 2   Date                               13351 non-null  int32
 3   Month                              13351 non-null  int32
 4   Year                               13351 non-null  int32
 5   Arrival_hour                       13351 non-null  int32
 6   Arrival_min                        13351 non-null  int32
 7   dept_hour                          13351 non-null  int32
 8   dept_min                           13351 non-null  int32
 9   total_duration_in_min              13351 non-null  int32
 10  Air India                          13351 non-null  int32
 11  GoAir                              13351 non-null  int32
 12  IndiGo                             13351 non-null  int32
 13  Jet Airways                        13351 non-null  int32
 14  Jet Airways Business               13351 non-null  int32
 15  Multiple carriers                  13351 non-null  int32
 16  Multiple carriers Premium economy  13351 non-null  int32
 17  SpiceJet                           13351 non-null  int32
 18  Trujet                             13351 non-null  int32
 19  Vistara                            13351 non-null  int32
 20  Vistara Premium economy            13351 non-null  int32
 21  Chennai                            13351 non-null  int32
 22  Delhi                              13351 non-null  int32
 23  Kolkata                            13351 non-null  int32
 24  Mumbai                             13351 non-null  int32
 25  Cochin                             13351 non-null  int32
 26  Delhi                              13351 non-null  int32
 27  Hyderabad                          13351 non-null  int32
 28  Kolkata                            13351 non-null  int32
 29  New Delhi                          13351 non-null  int32
 30  1 Short layover                    13351 non-null  int32
 31  2 Long layover                     13351 non-null  int32
 32  Business class                     13351 non-null  int32
 33  Change airports                    13351 non-null  int32
 34  In-flight meal not included        13351 non-null  int32
 35  No Info                            13351 non-null  int32
 36  No check-in baggage included       13351 non-null  int32
 37  No info                            13351 non-null  int32
 38  Red-eye flight                     13351 non-null  int32
dtypes: float64(1), int32(37), int64(1)
memory usage: 2.2 MB

In [38]:
df_7.head(2)

,Total_Stops,Price,Date,Month,Year,Arrival_hour,Arrival_min,dept_hour,dept_min,total_duration_in_min,...,New Delhi,1 Short layover,2 Long layover,Business class,Change airports,In-flight meal not included,No Info,No check-in baggage included,No info,Red-eye flight
0,0,3897.0,24,3,2019,1,10,22,20,170,...,1,0,0,0,0,0,0,0,1,0
1,2,7662.0,1,5,2019,13,15,5,50,445,...,0,0,0,0,0,0,0,0,1,0

## Seperating Train and Test Data:

In [41]:
df_test = df_7[df_7['Price'].isnull()]
df_train = df_7[~df_7['Price'].isnull()]

In [42]:
df_train.shape , df_test.shape

((10681, 39), (2670, 39))

In [43]:
df_test['Price'].isnull().sum()

2670